{
  "experience": [
    {
      "company": "TIM S.A.",
      "date": "2022 - <i class='fas fa-history'></i>",
      "description": "Durante meu estágio atual, estou focado em automatizar processos para impulsionar a eficiência e a tomada de decisões estratégicas. Abaixo estão as principais realizações e aprendizados que obtive:<br><br>-<strong>Automatização de Relatórios e Análise de Dados com Python:</strong> Implementei uma solução usando Python para automatizar a geração diária de uma base de dados a partir de diversos relatórios. Isso resultou em economia significativa de tempo e esforço, pois o processo agora é autônomo. Utilizei a biblioteca Pandas para processar os dados, garantindo que eles estejam prontos para análise. Além disso, utilizei a biblioteca Selenium para automatizar a coleta de relatórios em navegadores, economizando tempo e reduzindo erros humanos na obtenção de informações cruciais.<br><br>-<strong>Sistema de Aprovação de Demandas Transparente e Ágil:</strong> Desenvolvi um sistema de aprovação de demandas com interfaces para usuários solicitantes, gestores e equipe técnica. Isso trouxe maior transparência e agilidade ao processo de aprovação. Os solicitantes podem acompanhar o status de suas demandas em tempo real, melhorando a comunicação e a satisfação dos usuários.<br><br>-<strong>Domínio do Google Cloud Platform (GCP) - BigQuery:</strong> Aprendi a utilizar o BigQuery, uma ferramenta poderosa do Google Cloud Platform, para análise e manipulação de dados. Essa habilidade me permite extrair insights valiosos dos dados coletados, contribuindo para decisões estratégicas.<br><br>Essas experiências têm sido fundamentais para o meu desenvolvimento profissional durante o estágio, proporcionando valiosos conhecimentos em automação de processos, análise de dados, uso de ferramentas como Pandas, Selenium e BigQuery, bem como em design de sistemas para otimização de processos internos."
    },
    {
      "company": "Depósito Primos",
      "date": "2018 - 2022",
      "description": "Durante 5 anos, adquiri experiência valiosa que contribuiu para o meu desenvolvimento profissional. Desempenhei um papel fundamental na atualização e gerenciamento de uma extensa base de dados contendo todos os produtos de venda da empresa. Minhas responsabilidades incluíam atualizar os registros de preços, dados fiscais e outras informações relevantes.<br><br>Além disso, criei automações para simplificar o processo de atualização de produtos e preços. Tive a oportunidade de aplicar minha criatividade e propor melhorias, mesmo em áreas além das minhas atribuições, o que resultou na criação de um programa em Python para calcular lajes de concreto e forros de PVC em projetos de construção civil."

    }
  ],
  "education": [
    {
      "university": "Centro Universitário - FAM",
      "date": "2020 - 2024  ",
      "description": "Sou estudante de engenharia da computação no Centro Universitário - FAM, buscando atualmente meu diploma na área. Estou entusiasmado com o potencial impacto que meu trabalho pode ter na sociedade e dedicado a aprender e crescer continuamente como engenheiro de computação."
    },
    {
      "university": "Asimov Academy - Aplicações IA",
      "date": "2024",
      "description": "Concluí a formação em Inteligência Artificial pela Asimov Academy, onde explorei as principais tecnologias e aplicações de IA disponíveis no mercado.<br><br>Durante o curso, adquiri certificações nas seguintes áreas:<br><br>- Explorando as principais IAs de Geração de Texto<br>- Aplicações de IA com LangChain<br>- Explorando o Universo das IAs com Hugging Face<br>- IAs para Imagens e Áudio com Hugging Face<br><br>Essa formação me permitiu dominar as ferramentas e técnicas mais avançadas para a criação e implementação de soluções de IA em diversos contextos." },
    {
      "university": "Asimov Academy - Machine Learning Avançada",
      "date": "2024",
      "description": "Concluí a formação em Data Science e Machine Learning pela Asimov Academy, onde aprofundei meus conhecimentos em diversas áreas essenciais para análise de dados e machine learning.<br><br>Durante o curso, completei uma série de atividades práticas, incluindo:<br><br>- Analisando Dados com Pandas & SQL<br>- Visualização de Dados com Matplotlib<br>- Visualização de Dados Avançada com Seaborn<br>- Fundamentos de AI e Machine Learning<br>- Matemática para Análise de Dados<br>- Modelos de Classificação e Regressão<br>- Modelos Não Supervisionados<br>- Árvores de Decisão e Ensemble Learning<br>- Análise de ações com Machine Learning<br>- Análise de vendas do marketplace Wish<br>- Prevendo risco de doenças cardíacas com Machine Learning<br><br>Essa formação me proporcionou uma sólida base para desenvolver e implementar soluções de análise de dados e machine learning em projetos reais."},    {
      "university": "Alura - Machine Learning Avançada",
      "date": "2023",
      "description": "Completei uma formação em Machine Learning Avançada, destacando-me em diversos tópicos-chave. No Deep Learning, explorei Keras, compreendi o processo de aprendizado da rede e apliquei previsões. Em Linguagem Natural, abordei análise de sentimentos, regex, modelos de linguagem e Word2Vec para interpretação avançada. No campo de reconhecimento de imagens, utilizei Twitter e Computer Vision API, além de explorar análise e classificação de faces com OpenCV. Essa jornada me equipou com conhecimentos  sólidos e habilidades práticas, preparando-me para desafios complexos em Inteligência Artificial."    },
    {
      "university": "Alura - JavaScript",
      "date": "2023",
      "description": "Concluí a formação em JavaScript, que me ensinou a construir aplicativos web interativos e dinâmicos. Este programa me proporcionou uma base sólida em JavaScript e a capacidade de trabalhar com APIs, permitindo-me criar aplicativos que consomem dados de fontes externas. Conquistei a habilidade de usar JavaScript para desenvolver aplicativos web envolventes e responsivos."
    },
    {
      "university": "Alura - HTML & CSS",
      "date": "2023",
      "description": "Concluí uma série de cursos em HTML e CSS para projetos web, adquirindo as habilidades necessárias para projetar e desenvolver páginas web envolventes e responsivas. Adquiri capacidade de criar páginas web que atendam às necessidades do usuário e garantem a experiência geral do usuário."
    },
    {
      "university": "Alura - Python e Orientação a Objetos",
      "date": "2022 - 2023",
      "description": "Concluí a formação em Python e Programação Orientada a Objetos pela Alura. Este programa me capacitou com o conhecimento e as habilidades necessárias para desenvolver aplicativos complexos usando Python e princípios de programação orientada a objetos. Através dessa experiência, adquiri uma compreensão mais profunda de conceitos e técnicas de programação e me sinto confiante em aplicar essas habilidades a cenários do mundo real."
    },
    {
      "university": "Stafford House International",
      "date": "2020",
      "description": "Tive a oportunidade de estudar na Stafford House no Canadá, onde alcancei proficiência em inglês por meio da imersão na língua e cultura. Foi uma experiência transformadora que não apenas aprimorou minhas habilidades linguísticas, mas também ampliou minha compreensão de diferentes perspectivas e modos de vida. Essa experiência me deu a confiança para me comunicar efetivamente em inglês e me preparou para trabalhar em um ambiente global."
    }
  ]
}
