{
  "experience": [
    {
      "company": "TIM S.A.",
      "date": "2022 - <i class='fas fa-history'></i>",
      "description": "Atualmente, como estagiário na TIM, desempenho um papel na gestão e o planejamento de projetos de TI, colaborando de perto com profissionais experientes. Esta experiência tem sido enriquecedora, e mantenho entusiasmo em aprimorar continuamente minhas habilidades neste cargo. Minhas atribuições englobam a implementação de automações de processos, visando aprimorar a eficiência operacional e simplificar tomadas de decisão. Destaco a criação de automações em Python, otimizando a geração de relatórios, e a criação de um sistema de aprovação de demandas, resultando em maior transparência e agilidade no processo. Essa iniciativa contribuiu significativamente para uma gestão mais eficiente."
    },
    {
      "company": "Depósito Primos",
      "date": "2018 - 2022",
      "description": "Durante 5 anos, adquiri uma ampla experiência que contribuiu significativamente para o meu desenvolvimento profissional. No meu papel, fui encarregado da atualização e gestão de uma extensa base de produtos, abrangendo registros de preços e informações fiscais. Introduzi automações que otimizaram drasticamente o processo de atualização, reduzindo a carga de trabalho manual ao cadastrar ou atualizar produtos. Além disso, propus e implementei melhorias além das minhas responsabilidades rotineiras, resultando na criação de um programa em Python para calcular lajes de concreto em projetos de construção civil. Essa iniciativa teve um impacto significativo no aprimoramento do serviço da empresa, oferecendo uma solução eficaz para os clientes. Também demonstrei proficiência avançada no Microsoft Excel, criando controles administrativos automatizados. Utilizando o VBA, desenvolvi ferramentas personalizadas para melhorar ainda mais os processos diários da empresa."
    }
  ],
  "education": [
    {
      "university": "Centro Universitário - FAM",
      "date": "2020 - <i class='fas fa-history'></i>",
      "description": "Sou estudante de engenharia da computação no Centro Universitário - FAM, buscando atualmente meu diploma na área. Estou entusiasmado com o potencial impacto que meu trabalho pode ter na sociedade e dedicado a aprender e crescer continuamente como engenheiro de computação."
    },
    {
      "university": "Alura - Machine Learning Avançada",
      "date": "2023",
      "description": "Completei uma formação em Machine Learning Avançada, destacando-me em diversos tópicos-chave. No Deep Learning, explorei Keras, compreendi o processo de aprendizado da rede e apliquei previsões. Em Linguagem Natural, abordei análise de sentimentos, regex, modelos de linguagem e Word2Vec para interpretação avançada. No campo de reconhecimento de imagens, utilizei Twitter e Computer Vision API, além de explorar análise e classificação de faces com OpenCV. Essa jornada me equipou com conhecimentos  sólidos e habilidades práticas, preparando-me para desafios complexos em Inteligência Artificial."    },
    {
      "university": "Alura - JavaScript",
      "date": "2023",
      "description": "Concluí a formação em JavaScript, que me ensinou a construir aplicativos web interativos e dinâmicos. Este programa me proporcionou uma base sólida em JavaScript e a capacidade de trabalhar com APIs, permitindo-me criar aplicativos que consomem dados de fontes externas. Conquistei a habilidade de usar JavaScript para desenvolver aplicativos web envolventes e responsivos."
    },
    {
      "university": "Alura - HTML & CSS",
      "date": "2023",
      "description": "Concluí uma série de cursos em HTML e CSS para projetos web, adquirindo as habilidades necessárias para projetar e desenvolver páginas web envolventes e responsivas. Adquiri capacidade de criar páginas web que atendam às necessidades do usuário e garantem a experiência geral do usuário."
    },
    {
      "university": "Alura - Python e Orientação a Objetos",
      "date": "2022 - 2023",
      "description": "Concluí a formação em Python e Programação Orientada a Objetos pela Alura. Este programa me capacitou com o conhecimento e as habilidades necessárias para desenvolver aplicativos complexos usando Python e princípios de programação orientada a objetos. Através dessa experiência, adquiri uma compreensão mais profunda de conceitos e técnicas de programação e me sinto confiante em aplicar essas habilidades a cenários do mundo real."
    },
    {
      "university": "Stafford House International",
      "date": "2020",
      "description": "Tive a oportunidade de estudar na Stafford House no Canadá, onde alcancei proficiência em inglês por meio da imersão na língua e cultura. Foi uma experiência transformadora que não apenas aprimorou minhas habilidades linguísticas, mas também ampliou minha compreensão de diferentes perspectivas e modos de vida. Essa experiência me deu a confiança para me comunicar efetivamente em inglês e me preparou para trabalhar em um ambiente global."
    }
  ]
}
