{
  "skills": [
    {
      "title": "Python",
      "icon": "fab fa-python",
      "text": "Python foi a primeira linguagem que aprendi e despertou minha paixão pela programação. <br><br> Desenvolvi habilidades em Python através de estudos, incluindo cursos especializados em Programação Orientada a Objetos e diversos projetos que realizei, envolvendo análise de dados, machine learning, técnicas de automação, APIs e sistemas web. <br><br> Você pode explorar projetos que demonstram minha experiência em Python em meu portfólio abaixo."    },
    {
      "title": "Machine Learning",
      "icon": "fas fa-robot",
      "text": "Machine Learning é uma área fascinante que explorei intensamente em meus projetos. <br><br> Nos cursos da formação em Machine Learning Avançada, aprofundei em Deep Learning com Keras, análise de sentimento em NLP, Word2Vec para classificação de artigos e até reconhecimento facial com OpenCV. <br><br> Além disso, tenho experiência em frameworks como TensorFlow e scikit-learn, utilizando dados para treinar modelos e alcançar resultados precisos, além de disponibilizar modelos em API."    },
    {
      "title": "SQL",
      "icon": "fas fa-database",
      "text": "SQL é uma linguagem essencial para o gerenciamento de bancos de dados relacionais. <br><br> Desenvolvi habilidades em SQL através de projetos práticos e estudos autodidatas. Posso projetar e consultar bancos de dados de forma eficiente, garantindo a integridade e segurança dos dados."    },
    {
      "title": "Git & GitHub",
      "icon": "fab fa-github",
      "text": "Git é uma ferramenta fundamental em meu fluxo de trabalho.<br><br> Utilizo o GitHub para colaboração eficiente, controle de versão e revisão de código. Meus repositórios refletem projetos significativos e contribuições para a comunidade. <br><br> Convido você a explorar meu perfil no GitHub para ter uma visão mais detalhada de meus projetos e contribuições."
    },
    {
      "title": "JavaScript",
      "icon": "fab fa-js-square",
      "text": "JavaScript faz parte da minha jornada de desenvolvimento web. <br><br> Adquiri uma compreensão profunda de sua versatilidade e aplicações práticas. Minha proficiência se estende à manipulação do Document Object Model (DOM), utilização do local storage, integração com APIs e manipulação hábil de JSON. <br><br> Explore meu portfólio para ver uma coleção de aplicações web dinâmicas e interativas que destacam meu uso eficaz de JavaScript."
    },
    {
      "title": "PHP",
      "icon": "fab fa-php",
      "text": "PHP é uma linguagem de script amplamente utilizada para o desenvolvimento web. <br><br> Desenvolvi um sistema de nutricionista web usando principalmente PHP no lado do servidor para comunicar com o banco de dados. Com o sistema, os usuários podem visualizar seus planos alimentares personalizados, responder questionários, acompanhar seu progresso e muito mais. <br><br>  Convido você a explorar o projeto 'Website Nutricionista' abaixo para saber mais sobre este sistema e a utilização do eficaz do PHP."    },
    {
      "title": "HTML5",
      "icon": "fab fa-html5",
      "text": "HTML forma a base do desenvolvimento web. Com expertise em tags semânticas do HTML5, criei páginas web bem estruturadas, priorizando acessibilidade e otimização para mecanismos de busca. <br><br> Você pode explorar projetos que demonstram minha experiência na combinação de HTML e CSS em meu portfólio."
    },
    {
      "title": "CSS3",
      "icon": "fab fa-css3-alt",
      "text": "CSS é uma ferramenta poderosa que não apenas me permite transformar páginas web HTML estáticas, mas também criar experiências visualmente impressionantes e responsivas. <br><br> Ao aderir à abordagem mobile-first, priorizo o desenvolvimento de sites totalmente otimizados para dispositivos móveis. <br><br> Além disso, meus projetos no portfólio exemplificam minha proficiência em utilizar o CSS3 para criar interfaces esteticamente agradáveis e amigáveis ao usuário."
    },
    {
      "title": "Java",
      "icon": "fab fa-java",
      "text": "Java é uma das linguagens de programação mais populares e versáteis. <br><br> Eu utilizei Java em uma variedade de projetos durante minha graduação, com foco na programação orientada a objetos. <br><br> Estou constantemente aprendendo e explorando novas técnicas e bibliotecas em Java para expandir minhas habilidades e conhecimentos."
    }
    
    

  ]
}
